app/controllers/school_classes_controller.rb

def create
  @school_class = SchoolClass.new(school_class_params)
  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Ergonomics"], ["room_number", 21]]

def update
  @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]